"""
Тема 14. Магические методы
"""


# Задание 1
# Создайте класс City с атрибутами name и population.
# Добавьте метод __str__(), который возвращает:
# Город <name>, население: <population>
# Создайте город и выведите его через print().


# TODO: решение


# Задание 2
# Создайте класс Movie с атрибутами title и year.
# Добавьте метод __repr__(), который возвращает строку:
# Movie(title='<title>', year=<year>)
# Проверьте вывод объекта.


# TODO: решение


# Задание 3
# Создайте класс Point с атрибутами x и y.
# Добавьте метод __eq__(), чтобы две точки считались равными,
# если у них одинаковые x и y.
# Проверьте сравнение двух объектов через ==.


# TODO: решение


# Задание 4
# Создайте класс Playlist.
# Внутри храните список songs.
# Добавьте метод add_song(song).
# Добавьте метод __len__(), чтобы len(playlist) возвращал количество песен.


# TODO: решение


# Задание 5
# Создайте класс Package с атрибутами code и weight.
# Добавьте метод __lt__(), чтобы посылки сравнивались по весу.
# Проверьте выражение package1 < package2.


# TODO: решение


# Задание 6
# Создайте класс Wallet с атрибутами owner и amount.
# Добавьте __str__(), который возвращает:
# Кошелек <owner>: <amount> руб.
# Добавьте __eq__(), который сравнивает кошельки по owner и amount.


# TODO: решение
