"""
Тема 4. Циклы for и while
"""


# Задание 1
# Выведите числа от 1 до 10 с помощью цикла for.


# TODO: решение


# Задание 2
# Выведите все четные числа от 2 до 20.


# TODO: решение


# Задание 3
# Спросите у пользователя число n.
# Посчитайте сумму чисел от 1 до n.


# TODO: решение


# Задание 4
# Спросите у пользователя число.
# Выведите таблицу умножения для этого числа от 1 до 10.


# TODO: решение


# Задание 5
# С помощью while попросите пользователя вводить числа.
# Складывайте их, пока пользователь не введет 0.
# После ввода 0 выведите сумму.


# TODO: решение


# Задание 6
# Спросите у пользователя число n.
# Выведите обратный отсчет от n до 1.


# TODO: решение
