"""
Тема 3. Условия и логические выражения
"""


# Задание 1
# Спросите у пользователя возраст.
# Если возраст 18 или больше, выведите "Можно получить права".
# Иначе выведите "Пока рано".


# TODO: решение


# Задание 2
# Спросите у пользователя число.
# Определите, положительное оно, отрицательное или равно нулю.


# TODO: решение


# Задание 3
# Спросите у пользователя пароль.
# Если пароль равен "python123", выведите "Доступ разрешен".
# Иначе выведите "Неверный пароль".


# TODO: решение


# Задание 4
# Спросите у пользователя оценку от 1 до 5.
# Выведите текст:
# 5 -> Отлично
# 4 -> Хорошо
# 3 -> Удовлетворительно
# 1 или 2 -> Нужно учиться
# другое число -> Некорректная оценка


# TODO: решение


# Задание 5
# Спросите у пользователя температуру и наличие дождя.
# Дождь можно вводить как "да" или "нет".
# Если температура выше 20 и дождя нет, выведите "Можно гулять".
# Иначе выведите "Лучше остаться дома".


# TODO: решение


# Задание 6
# Спросите у пользователя год.
# Определите, является ли год високосным.
# Год високосный, если делится на 4, но не делится на 100,
# или если делится на 400.


# TODO: решение
