"""
Тема 6. Списки
"""


# Задание 1
# Создайте список из пяти любимых продуктов.
# Выведите первый, третий и последний элемент.


# TODO: решение


# Задание 2
# Создайте список чисел [3, 7, 1, 9, 4].
# Выведите сумму, минимальное и максимальное число.


# TODO: решение


# Задание 3
# Создайте пустой список.
# Спросите у пользователя три имени и добавьте их в список.
# Выведите итоговый список.


# TODO: решение


# Задание 4
# Дан список numbers = [1, 2, 3, 4, 5, 6, 7, 8].
# Создайте новый список только из четных чисел.

numbers = [1, 2, 3, 4, 5, 6, 7, 8]

# TODO: решение


# Задание 5
# Дан список grades = [5, 4, 3, 5, 2, 4, 5].
# Посчитайте среднюю оценку.

grades = [5, 4, 3, 5, 2, 4, 5]

# TODO: решение


# Задание 6
# Спросите у пользователя пять чисел.
# Добавьте их в список.
# Выведите список в отсортированном виде.


# TODO: решение
